In [64]:
import pandas as pd

In [65]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [66]:
data = [10,20,30,40]

In [67]:
df = pd.DataFrame(data)
df

    0
0  10
1  20
2  30
3  40

In [68]:
data2 = [["Ömer",20,"Ankara"],["Ali",25,"Van"],["Ahmet",20,"İstanbul"]]
df2 = pd.DataFrame(data2)
df2

       0   1         2
0   Ömer  20    Ankara
1    Ali  25       Van
2  Ahmet  20  İstanbul

In [69]:
data2 = [["Ömer",20,"Ankara"],["Ali",25,"Van"],["Ahmet",20,"İstanbul"]]
df2 = pd.DataFrame(data2, columns=["İsim", "Yaş", "Şehir"], index=[1,2,3])
df2

    İsim  Yaş     Şehir
1   Ömer   20    Ankara
2    Ali   25       Van
3  Ahmet   20  İstanbul

In [70]:
data3 = {"İsim": ["Ayşe", "Buse", "Ceren"],
        "Yaş":   [20, 25, 18], 
        "Şehir": ["Van", "Rize", "Edirne"]}
df3 = pd.DataFrame(data3, columns=["İsim", "Yaş", "Şehir"], index=[1, 2, 3])
df3

    İsim  Yaş   Şehir
1   Ayşe   20     Van
2   Buse   25    Rize
3  Ceren   18  Edirne

In [71]:
df3["İsim"]

1     Ayşe
2     Buse
3    Ceren
Name: İsim, dtype: object

In [72]:
df3["Yaş"]

1    20
2    25
3    18
Name: Yaş, dtype: int64

In [73]:
del df3["Şehir"]
df3

    İsim  Yaş
1   Ayşe   20
2   Buse   25
3  Ceren   18

In [74]:
df2.pop("Şehir")
df2

    İsim  Yaş
1   Ömer   20
2    Ali   25
3  Ahmet   20

In [75]:
df3

    İsim  Yaş
1   Ayşe   20
2   Buse   25
3  Ceren   18

In [76]:
df3.loc[3]

İsim    Ceren
Yaş        18
Name: 3, dtype: object

In [77]:
df3.iloc[2]

İsim    Ceren
Yaş        18
Name: 3, dtype: object

In [78]:
df4 = df3.append(df2)
df4

C:\Users\OmerYildiz\AppData\Local\Temp\ipykernel_10244\2411415679.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df4 = df3.append(df2)

    İsim  Yaş
1   Ayşe   20
2   Buse   25
3  Ceren   18
1   Ömer   20
2    Ali   25
3  Ahmet   20

In [80]:
df4 = pd.concat([df2,df3])
df4

    İsim  Yaş
1   Ömer   20
2    Ali   25
3  Ahmet   20
1   Ayşe   20
2   Buse   25
3  Ceren   18

In [81]:
df4.head()

    İsim  Yaş
1   Ömer   20
2    Ali   25
3  Ahmet   20
1   Ayşe   20
2   Buse   25

In [82]:
df4.tail()

    İsim  Yaş
2    Ali   25
3  Ahmet   20
1   Ayşe   20
2   Buse   25
3  Ceren   18